In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame({'k1':['x','x','y','y','y'],'k2':['a','b','a','a','b'],'data1':np.random.randn(5),
               'data2':np.random.randn(5)})

In [3]:
df

      data1     data2 k1 k2
0 -0.722546 -0.503310  x  a
1 -0.183031  0.694082  x  b
2  1.727073 -1.397475  y  a
3  1.963235  0.601149  y  a
4  0.586302  0.108205  y  b

In [4]:
group1 = df['data1'].groupby(df['k1'])

In [5]:
group1

In [7]:
group1.mean()

k1
x   -0.452788
y    1.425537
Name: data1, dtype: float64

In [11]:
cities = np.array(['ny','la','la','ny','la'])

In [12]:
months = np.array(['jan','feb','jan','jan','feb'])

In [13]:
df['data1'].groupby([cities,months]).mean()

la  feb    0.201636
    jan    1.727073
ny  jan    0.620345
Name: data1, dtype: float64

In [14]:
df

      data1     data2 k1 k2
0 -0.722546 -0.503310  x  a
1 -0.183031  0.694082  x  b
2  1.727073 -1.397475  y  a
3  1.963235  0.601149  y  a
4  0.586302  0.108205  y  b

In [15]:
df.groupby('k1').mean()

       data1     data2
k1
x  -0.452788  0.095386
y   1.425537 -0.229373

In [16]:
df.groupby('k1').std()

       data1     data2
k1
x   0.381494  0.846684
y   0.736328  1.041199

In [17]:
df.groupby(['k1','k2']).mean()

          data1     data2
k1 k2
x  a  -0.722546 -0.503310
   b  -0.183031  0.694082
y  a   1.845154 -0.398163
   b   0.586302  0.108205

In [18]:
df.groupby('k1').size()

k1
x    2
y    3
dtype: int64

In [19]:
for name,group in df.groupby('k1'):
    print "this is the %s group" %name
    print group
    print '\n'

this is the x group
      data1     data2 k1 k2
0 -0.722546 -0.503310  x  a
1 -0.183031  0.694082  x  b


this is the y group
      data1     data2 k1 k2
2  1.727073 -1.397475  y  a
3  1.963235  0.601149  y  a
4  0.586302  0.108205  y  b

In [21]:
for (k1,k2), group in df.groupby(['k1','k2']):
    print "key1 = %s key2 = %s" %(k1,k2)
    print group
    print '\n'

key1 = x key2 = a
      data1    data2 k1 k2
0 -0.722546 -0.50331  x  a


key1 = x key2 = b
      data1     data2 k1 k2
1 -0.183031  0.694082  x  b


key1 = y key2 = a
      data1     data2 k1 k2
2  1.727073 -1.397475  y  a
3  1.963235  0.601149  y  a


key1 = y key2 = b
      data1     data2 k1 k2
4  0.586302  0.108205  y  b

In [22]:
group_dict = dict(list(df.groupby('k1')))

In [24]:
group_dict['x']

      data1     data2 k1 k2
0 -0.722546 -0.503310  x  a
1 -0.183031  0.694082  x  b

In [25]:
group_dict_axis1 = dict(list(df.groupby(df.dtypes,axis=1)))

In [26]:
group_dict_axis1

{dtype('float64'):       data1     data2
 0 -0.722546 -0.503310
 1 -0.183031  0.694082
 2  1.727073 -1.397475
 3  1.963235  0.601149
 4  0.586302  0.108205, dtype('O'):   k1 k2
 0  x  a
 1  x  b
 2  y  a
 3  y  a
 4  y  b}

groupby can be used to separate numbers and words

In [27]:
#groupby columns
d2 = df.groupby(['k1','k2'])[['data2']]

In [28]:
d2

In [29]:
d2.mean()

          data2
k1 k2
x  a  -0.503310
   b   0.694082
y  a  -0.398163
   b   0.108205